In [1]:
import pandas as pd

In [3]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
df = pd.read_csv('example')

In [5]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [1]:
df.to_csv('test_output',index=False)

NameError: name 'df' is not defined

In [9]:
pd.read_csv('test_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [4]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [6]:
df.to_excel('text_excel.xlsx',sheet_name='test')

In [ ]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [ ]:
type(data)
# probas esto en la casa

In [5]:
from sqlalchemy import create_engine

In [6]:
engine = create_engine('sqlite:///:memory:')

In [8]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [9]:
df.to_sql('my_table',engine)

In [10]:
sqldf = pd.read_sql('my_table',con=engine)

In [11]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15